from BoSegmenter.botok_tokenizer import get_segments


if __name__ == "__main__":
    text = "༄༅། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པའི་ཚིག་འགྲེལ་འཇམ་དབྱངས་བླ་མའི་ཞལ་ལུང་བདུད་རྩིའི་ཐིག་པ་བཞུགས་སོ།། །། ༄༅། །ན་མོ་གུ་རུ་མཉྫུ་ཤྲཱི་ཛྙཱ་ན་སཏྭཱ་ཡ། བསྐལ་བཟང་རྣམ་འདྲེན་གཞན་ལས་ཆེས་དཔའ་བའི། །སྙིང་རྗེས་ཐུགས་བསྐྱེད་སྨོན་ལམ་རྨད་བྱུང་བས། །དེང་འདིར་མངོན་པར་བྱང་ཆུབ་མཆོག་སྟོན་པའི། །སྟོན་པ་མཉམ་མེད་ཤཱཀྱ་སེང་གེས་སྐྱོངས། །མི་ཕམ་འཇམ་པའི་དབྱངས་སོགས་ཉེ་སྲས་བརྒྱད། །གནས་བརྟན་བཅུ་དྲུག་བསྟན་པའི་གཏད་རབས་བདུན། །འཛམ་གླིང་རྒྱན་མཆོག་ཞི་བའི་ལྷ་ལ་སོགས། །འཕགས་ཡུལ་པཎ་གྲུབ་དད་བརྒྱས་སྤྱི་བོར་བསྙེན། །"
    segments = get_segments(text)