from BoSegmenter.botok_tokenizer import get_segment_spans, get_segments

from pathlib import Path


def test_get_segment_spans():
    segments = [
        'hello',
        'world'
        ]
    expected_spans = [
        {
            'span': {
                'start': 0,
                'end': 5,
            },
        },
        {
            'span': {
                'start': 5,
                'end': 10,
            },
        },
    ]
    spans = get_segment_spans(segments)
    assert spans == expected_spans

def test_get_segments():
    text = "༄༅། །རྣམ་པར་བཤད་པ་རིགས་པའི་མདོ་སྡེའི་དུམ་བུ་བརྒྱ། ༄༅། །རྒྱ་གར་སྐད་དུ། བྱཱ་ཁྱཱ་ཡུཀྟི་སཱུ་ཏྲ་ཁཎྜ་ཤ་ཏཾ། བོད་སྐད་དུ། རྣམ་པར་བཤད་པ་རིགས་པའི་མདོ་སྡེའི་དུམ་བུ་བརྒྱ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཕྱག་འཚལ་ལོ། །ཆོས་གང་དག་ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་དགེ་བ། དོན་བཟང་པོ། །ཚིག་འབྲུ་བཟང་པོ། མ་འདྲེས་པ། ཡོངས་སུ་རྫོགས་པ། ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བ། ཚངས་པར་སྤྱོད་པ། མངོན་པར་བརྗོད་པས་མངོན་པར་རྗོད་པར་བྱེད་པ་ནི་མང་དུ་ཐོས་པ་དང་། ཐོས་པའི་གཞི་ཅན་དང་། ཐོས་པ་བསགས་པ་ཡིན་ཏེ། དེ་ཆོས་དེ་ལྟ་བུ་མང་པོ་ཐོས་པ་དང་། བཟུང་བ་དང་། "
    segments = get_segments(text)
    expected_segments = [
        '༄༅། །རྣམ་པར་བཤད་པ་རིགས་པའི་མདོ་སྡེའི་དུམ་བུ་བརྒྱ། ༄༅། །རྒྱ་གར་སྐད་དུ། བྱཱ་ཁྱཱ་ཡུཀྟི་སཱུ་ཏྲ་ཁཎྜ་ཤ་ཏཾ། བོད་སྐད་དུ། རྣམ་པར་བཤད་པ་རིགས་པའི་མདོ་སྡེའི་དུམ་བུ་བརྒྱ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཕྱག་འཚལ་ལོ། །ཆོས་གང་དག་ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་དགེ་བ། དོན་བཟང་པོ། །ཚིག་འབྲུ་བཟང་པོ། མ་འདྲེས་པ། ཡོངས་སུ་རྫོགས་པ། ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བ། ཚངས་པར་སྤྱོད་པ། མངོན་པར་བརྗོད་པས་མངོན་པར་རྗོད་པར་བྱེད་པ་ནི་མང་དུ་ཐོས་པ་དང་། ཐོས་པའི་གཞི་ཅན་དང་། ཐོས་པ་བསགས་པ་ཡིན་ཏེ། ',
        'དེ་ཆོས་དེ་ལྟ་བུ་མང་པོ་ཐོས་པ་དང་། བཟུང་བ་དང་། ',
    ]
    assert segments == expected_segments

if __name__ == "__main__":
    # test_get_segment_spans()
    test_get_segments()